import { Component, OnInit } from '@angular/core';
import { ApiService } from './api/api.service';

@Component({
  selector: 'app-process',
  templateUrl: './process.component.html',
  styleUrls: ['./process.component.scss']
})
export class ProcessComponent implements OnInit {
  show = false;
  prid = '0';
  constructor(private api: ApiService) { }
  title = 'ພະແນກສັງລວມ';

  jsonData: any[] = [
    // {
    //   prId: '1',
    //   prDsc: 'ພິທີສະເຫຼີມສະຫຼອງວັນສ້າງຕັ້ງ ມະຫາວິທະຍາໄລແຫ່ງຊາດ (ມຊ) ຄົບຮອບ 25 ປີ (5 ພະຈິກ 1996 – 5 ພະຈິກ 2021) ໄດ້ຈັດຂຶ້ນໃນວັນທີ 22 ທັນວາ 2021 ທີ່ສະຖາບັນຂົງຈື ມຊ ພາຍໃຕ້ການເປັນປະທານຂອງ ທ່ານ ອຸດົມ ພອນຄໍາເພັງ ຮັກສາການອະທິການບໍດີ ມະຫາວິທະຍາໄລແຫ່ງຊາດ ຊຶ່ງໄດ້ຮັບກຽດເຂົ້າຮ່ວມຂອງ ທ່ານ ທອງລຸນ ສີສຸລິດ ເລຂາທິການໃຫຍ່ ຄະນະບໍລິຫານງານສູນກາງພັກ ປະທານປະເທດ ແຫ່ງ ສປປ ລາວ; ມີລັດຖະມົນຕີ, ຮອງລັດຖະມົນຕີ, ອະດີດປະທານສະພາ ມຊ ແລະ ອະດີດອາທິການບໍດີ ພ້ອມດ້ວຍບັນດາຄູ-ອາຈານ, ນັກສຶກສາ ເຂົ້າຮ່ວມ.',
    //   prTitle: 'ຂະແໜງແຜນການ ແລະ ການຮ່ວມມື',
    //   refId: '1',
    // },
    // {
    //   prId: '2',
    //   prDsc: 'ໃນພິທີ ທ່ານ ອຸດົມ ພອນຄໍາເພັງ ໄດ້ຜ່ານບົດລາຍງານສະພາບການເຄື່ອນໄຫວ ແລະ ຜົນງານຂອງມະຫາວິທະຍາໄລແຫ່ງຊາດໃນໄລຍະ 25 ປີ 1996-2021; ມະຫາວິທະຍາໄລແຫ່ງຊາດ ສ້າງຕັ້ງຂຶ້ນຕາມດຳລັດຂອງນາຍົກລັດຖະມົນຕີ ສະບັບ ເລກທີ 50/ນຍ, ລົງວັນທີ 9 ມິຖຸນາ 1995 ແລະ ໄດ້ເປີດສົກຮຽນຄັ້ງປະຖົມມະລືກຂຶ້ນຢ່າງເປັນທາງການໃນວັນທີ 5 ພະຈິກ 1996 ດ້ວຍການເຕົ້າໂຮມເອົາ 10 ສະຖາບັນການສຶກສາຊັ້ນສູງ ຊຶ່ງເມື່ອກ່ອນຂຶ້ນກັບຫຼາຍກະຊວງເຂົ້າມາເປັນມະຫາວິທະຍາໄລແຫ່ງຊາດ (ເອີ້ນຫຍໍ້ວ່າ ມຊ) ພາຍໃຕ້ການຊີ້ນໍາຂອງກະຊວງສຶກສາທິການ ແລະ ກິລາ. ທາງດ້ານໂຄງສ້າງການຈັດຕັ້ງ, ໃນເບື້ອງຕົ້ນ ມຊ ມີ 8 ຄະນະວິຊາ, 7 ຫ້ອງການ, 1 ວິທະຍາໄລ ແລະ 1 ຫໍສະໝຸດກາງ.',
    //   prTitle: 'ຂະແໜງກວດກາລັດ',
    //   refId: '1',
    // },
    // {
    //   prId: '3',
    //   prDsc: 'ຕະຫຼອດໄລຍະ 25 ປີແຫ່ງການພັດທະນາ ມະຫາວິທະຍາໄລແຫ່ງຊາດ ໄດ້ມີການເຕີບໃຫຍ່ ຂະຫຍາຍຕົວທາງດ້ານປະລິມານ ແລະ ຄຸນນະພາບ, ພ້ອມທັງໄດ້ປັບປຸງກົງຈັກການຈັດຕັ້ງໃຫ້ແທດເໝາະກັບສະພາບປັດຈຸບັນ, ມຊ ປະກອບມີ 13 ຄະນະວິຊາ, 2 ສະຖາບັນ, 11 ຫ້ອງການ, ມີ 8 ສູນ, ມີ 1 ຫໍສະໝຸດກາງ, 1 ໂຮງໝໍ ມຊ ແລະ ໂຮງຮຽນພອນສະຫວັນ ແລະ ຊົນເຜົ່າກຽມມະຫາວິທະຍາໄລ, ມີພະນັກງານປະຈຳທັງໝົດ 1.763 ຄົນ ຍິງ 824 ຄົນ; ຊຶ່ງປະກອບມີ: ອາຈານສອນ 1.445 ຄົນ ຍິງ 637 ຄົນ; ປະລິນຍາເອກ 186 ຄົນ ຍິງ 41 ຄົນ; ປະລິນຍາໂທ 956 ຄົນ ຍິງ 408 ຄົນ; ປະລິນຍາຕີ ຈໍານວນ 568 ຄົນ ຍິງ 343 ຄົນ; ວິທະຍານາມມະຍົດສາດສະດາຈານ 1 ທ່ານ; ຮອງສາດສະດາຈານ 79 ທ່ານ ຍິງ 10 ທ່ານ. ມຊ ໄດ້ຖືເອົາວຽກງານ ການຮຽນ-ການສອນ ເປັນໝາກຫົວໃຈສຳຄັນໃນການກໍ່ສ້າງນັກສຶກສາ ແລະ ພັດທະນາຊັບພະຍາກອນມະນຸດ. ປັດຈຸບັນ ມຊ ມີນັກສຶກສາ ທັງໝົດ 22.861 ຄົນ ຍິງ 11.425 ຄົນ, ໃນນັ້ນມີ ນັກສຶກສາລະດັບປະລິນຍາເອກ: 16 ຄົນ ຍິງ 2 ຄົນ; ນັກສຶກສາລະດັບປະລິນຍາໂທ ຈໍານວນ 1.104 ຄົນ ຍິງ 432 ຄົນ; ນັກສຶກສາລະດັບປະລິນຍາຕີ 22.621 ຄົນ ຍິງ 10.947 ຄົນ; ນັກສຶກສາລະດັບອະນຸປະລິນຍາ 120 ຄົນ ຍິງ 44 ຄົນ.',
    //   prTitle: 'ຂະແໜງອຸດສາຫະກຳ ແລະ ຫັດຖະກຳ',
    //   refId: '1',
    // },
    // {
    //   prId: '4',
    //   prDsc: 'ສໍາລັບຫຼັກສູດການຮຽນ-ການສອນ ແຕ່ລະໄລຍະຂອງການພັດທະນາ ມຊ ໄດ້ດໍາເນີນການຮຽນ-ການສອນໃນຫຼາຍລະດັບ ຊຶ່ງນັບແຕ່ປີ 1996 ເຖິງ 2021 ມີການສ້າງຫຼັກສູດລວມທັງໝົດ 233 ຫຼັກສູດ ໃນນັ້ນມີ: ຫຼັກສູດລະດັບປະລິນຍາຕີ 107 ຫຼັກສູດ; ຫຼັກສູດຕໍ່ເນື່ອງປະລິນຍາຕີ 39 ຫຼັກສູດ; ອະນຸປະລິນຍາຕີ 4 ຫຼັກສູດ; ຫຼັກສູດປະລິນຍາໂທ 66 ຫຼັກສູດ; ຫຼັກສູດປະລິນຍາເອກ 6 ຫຼັກສູດ; ຫຼັກສູດນານາຊາດ 5 ຫຼັກສູດ. ຕະຫຼອດໄລຍະເວລາ 25 ປີຜ່ານມາ ມຊ ໄດ້ສ້າງບຸກຄະລາກອນຮັບໃຊ້ປະເທດຊາດ ລວມທັງໝົດ 120.171 ຄົນ ຍິງ',
    //   prTitle: 'ຂະແໜງການຄ້າພາຍໃນ',
    //   refId: '1',
    // },
    // {
    //   prId: '5',
    //   prDsc: '44.675 ຄົນ. ດ້ານການຄົ້ນຄວ້າວິທະຍາສາດ ແລະ ບໍລິການວິຊາການ ໄດ້ສໍາເລັດການເຮັດບົດຄົ້ນຄວ້າວິທະຍາສາດຈໍານວນ 697 ໂຄງການ. ມີນັກຄົ້ນຄວ້າທັງໝົດ 1.142 ທ່ານ ຍິງ 459 ທ່ານ, ມີນັກຄົ້ນຄວ້າດີເດັ່ນ 20 ທ່ານ, ນອກຈາກນີ້ຍັງໄດ້ບໍລິການວິຊາການ ຈໍານວນ 914 ຄັ້ງ, ດ້ານການຮ່ວມມືກັບສາກົນ ໄດ້ມີການຮ່ວມມືກັບມະຫາວິທະຍາໄລຕ່າງປະເທດ ແລະ ອົງການຈັດຕັ້ງສາກົນຕ່າງໆ. ສໍາລັບແຜນພັດທະນາຂອງ ມຊ ໃນຊຸມປີຕໍ່ໜ້າ ເພື່ອບັນລຸຈຸດໝາຍລວມຕາມພາລະບົດບາດ, ໜ້າທີ່ ແລະ ວິໄສທັດ ຂອງ ມຊ ໃນການພັດທະນາຄຸນນະພາບການ',
    //   prTitle: 'ຂະແໜງທະບຽນ ແລະ ຄຸ້ມຄອງວິສາຫະກິດ',
    //   refId: '1',
    // },
    // {
    //   prId: '6',
    //   prDsc: 'ຂອງ ມຊ ໃນຊຸມປີຕໍ່ໜ້າ ເພື່ອບັນລຸຈຸດໝາຍລວມຕາມພາລະບົດບາດ, ໜ້າທີ່ ແລະ ວິໄສທັດ ຂອງ ມຊ ໃນການພັດທະນາຄຸນນະພາບການສຶກສານັ້ນ ມຊ ຈຶ່ງໄດ້ກຳນົດເປັນ 7 ແຜນງານ 37 ໂຄງການ ຊຶ່ງເນັ້ນໃສ່ 7 ດ້ານ ດັ່ງນີ້: ຫັນການຮຽນ-ການສອນແບບ Online ແລະ ນໍາໃຊ້ ICT Technology ໃຫ້ຫຼາຍຂຶ້ນ; ພັດທະນາຫຼັກສູດນານາຊາດໃຫ້ຫຼາຍຂຶ້ນ; ຫັນການຮຽນ-ການສອນເປັນພາສາອັງກິດໃຫ້ຫຼາຍຂຶ້ນ; ຫັນເອົາການຮຽນ-ການສອນ ແລະ ຝຶກອົບຮົມພາສາຈີນໃຫ້ຫຼາຍຂຶ້ນ; ການສ້າງນັກສຶກສາທີ່ຈົບໄປໃຫ້ກາຍເປັນຜູ້ປະກອບການເອງ; ສົ່ງເສີມການຮຽນຮູ້ ແລະການນໍາໃຊ້ ICT Technology ແລະ Innovation ແລະ ການສ້າງນັກສຶກສາໃຫ້ມີຄວາມຮູ້ຢ່າງຫຼາກຫຼາຍ.',
    //   prTitle: 'ຂະແໜງນຳເຂົ້າ ແລະ ສົ່ງອອກ',
    //   refId: '1',
    // },

    // {
    //   prId: '7',
    //   prDsc: 'ໃນໂອກາດດັ່ງກ່າວ ກໍໄດ້ຮັບຟັງການໂອ້ລົມຂອງ ທ່ານ ທອງລຸນ ສີສຸດລິດ ກ່ອນອື່ນທ່ານໄດ້ສະແດງຄວາມຊົມເຊີຍ ແລະ ຍ້ອງຍໍສັນລະເສີນຕໍ່ຜົນສໍາເລັດອັນໃຫຍ່ຫຼວງ ທີ່ມະຫາວິທະຍາໄລແຫ່ງຊາດ ຍາດມາໄດ້ຕະຫຼອດໄລຍະ 25 ປີ ຜ່ານມາ, ໃນຊຸມປີຕໍ່ໜ້າ ມຊ ຈະຕ້ອງໄດ້ສືບຕໍ່ເປັນສະຖາບັນການສຶກສາແຖວໜ້າໃນການປະກອບສ່ວນກໍ່ສ້າງ ແລະ ພັດທະນາຊັບພະຍາກອນມະນຸດ ຊຶ່ງຄາດໝາຍໃຫຍ່ທີ່ຕ້ອງບັນລຸແມ່ນຕ້ອງຜັນຂະຫຍາຍທິດນໍາ ກ່ຽວກັບ ສ້າງຄົນລາວໃຫ້ມີຄວາມພ້ອມໃນທຸກດ້ານ, ສາມາດກາຍເປັນກໍາລັງຂັບເຄື່ອນຕົ້ນຕໍ ໃຫ້ແກ່ການພັດທະນາປະເທດຊາດ.',
    //   prTitle: 'ຂະແໜງສົ່ງເສີມວິສາຫະກິດຂະໜາດນ້ອຍ ແລະ ກາງ ແລະ ການຄ້າ',
    //   refId: '1',
    // },

    // {
    //   prId: '8',
    //   prDsc: 'ບົນຈິດໃຈດັ່ງກ່າວນັ້ນ ທ່ານໄດ້ໃຫ້ສືບຕໍ່ພັດທະນາ ມຊ ໃຫ້ມີຄວາມເຂັ້ມແຂງໃນທຸກດ້ານ ໂດຍເສີມຂະຫຍາຍທ່າແຮງ ແລະ ຄວາມສາມາດບົ່ມຊ້ອນຂອງຕົນທີ່ມີຢູ່ໃນປັດຈຸບັນໂດຍເນັ້ນໜັກດ້ານຄຸນນະພາບເປັນຕົ້ນຕໍ, ມີຄວາມພ້ອມດ້ານສາຂາວິຊາຢ່າງຄົບຊຸດ, ສ້າງ ຄັງປັນຍາຄວາມຮູ້ ໃຫ້ທັນສະໄໝ; ມີການພັດທະນາຊັບພະຍາກອນມະນຸດ ເພື່ອຕອບສະໜອງຄວາມຕ້ອງການຂອງສັງຄົມແມ່ນໜຶ່ງໃນໜ້າທີ່ຕົ້ນຕໍ; ສືບຕໍ່ກໍ່ສ້າງຊັບພະຍາກອນມະນຸດທີ່ພຽບພ້ອມທັງຄວາມຮູ້ຄວາມສາມາດ ແລະ ມີຄຸນສົມບັດ ແມ່ນການສ້າງກໍາລັງແຮງທີ່ມີຄຸນນະພາບໃຫ້ແກ່ສັງຄົມ ກໍຄື',
    //   prTitle: 'ຂະແໜງຊັບສິນທາງປັນຍາ, ມາດຕະຖານ ແລະ ວັດແທກ',
    //   refId: '1',
    // },
  ];
  ngOnInit(): void {
    this.loadData();
  }

  setName(value: string): void {
    this.title = value;
  }

  loadData():void{
    const modal ={}
    this.api.loadProcess(modal).subscribe(res => {
      this.jsonData = res.data;
    })
  }

  getData(): any[]{
    return  this.jsonData.filter(f => f.refId === "1").reverse();
  }

}
