import { Component, OnInit } from '@angular/core';
import { ActivatedRoute, NavigationEnd, Route, Router } from '@angular/router';
import { ServiceService } from 'src/app/service.service';
import { ApiService } from './api/api.service';

@Component({
  selector: 'app-statistics',
  templateUrl: './statistics.component.html',
  styleUrls: ['./statistics.component.scss']
})
export class StatisticsComponent implements OnInit {
  id = 0;
  jsonData: {
    createDate: string;
    refId: string;
    spDsc: string;
    stEngLink: string;
    stId: string;
    stLaoLink: string;
    stTitle: string;
  }[] = [
    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ຫມູນວຽນມາອີກຄັ້ງ ກັບວັນຄູແຫ່ງຊາດ ວັນທີ 7 ຕຸລາ 1994 – ວັນທີ 7 ຕຸລາ 2021 ປີນີ້ຄົບຮອບ 27 ປີ ທີ່ ສປປ ລາວໄດ້ກຳນົດເອົາ ວັນທີ 7 ຕຸລາເປັນວັນຄູແຫ່ງຊາດ ຜູ້ເຊິ່ງຖ່າຍຖອດວິຊາຄວາມຮູ້ໃຫ້ແກ່ມວນມະນຸດໄດ້ ພັດທະນາຕົນເອງ ໃຫ້ມີຄວາມກ້າວໜ້າໄປຢ່າງບໍ່ຢຸດຢັ້ງ ຮູບການຖ່າຍທອດຄວາມຮູ້ຈາກຜູ້ຮູ້ ໄປສູ່ຜູ້ບໍ່ຮູ້ ເອີ້ນວ່າ: ການຮຽນ – ການສອນ ເຊິ່ງເປັນປັດໃຈສໍາຄັນຫນຶ່ງໃນການຕັດສິນຄຸນນະພາບຂອງການສຶກສາກໍຄື ການພັດທະນາມະນຸດ  ເຊິ່ງທຸກຄົນຈະມີຄວາມຮູ້, ຄວາມສາມາດໄດ້ນັ້ນກໍ່ຕ້ອງ ຜ່ານຂະບວນການສອນຂອງຄູ ແລະ ທຸກຄົນລ້ວນແຕ່ມີຄູສອນຕົນເອງ.',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '1'
    // },

    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ວັນຄູແຫ່ງຊາດແມ່ນ ເປັນວັນທີ່ພົນລະເມືອງລາວທຸກເຜົ່າ ທຸກຊັ້ນຄົນໃນວົງສາຄະນາຍາດແຫ່ງຊາດລາວ ໄດ້ສະເຫລີມສະຫລອງ  ແລະ ໄດ້ທົບທວນຂະບວນວິວັດທະນາການແຫ່ງຊີວິດ ໂດຍເລີ່ມຈາກຊີວິດໃນຍາມເປັນເດັກຢູ່ໃນການລ້ຽງດູຂອງພໍ່ແມ່, ຊີວິດຂອງຕົນໃນການເຄື່ອນໄຫວສຶກສາຮໍ່າຮຽນຈົນເຖິງປັດຈຸບັນ ວ່າໄດ້ຮັບການຖ່າຍທອດຄວາມຮູ້ຫຍັງແດ່ຈາກພໍ່ແມ່ ແລະ ຄູອາຈານ ທັງນີ້ກໍ່ເພື່ອໃຫ້ທຸກຄົນໄດ້ສະແດງຄວາມກະຕັນຍູຮູ້ບຸນຄຸນຕໍ່ຄູອາຈານ ການຈັດຕັ້ງສະເຫລີມສະຫລອງວັນຄູ ຍັງແມ່ນການເຊີດຊູກຽດສັກສີ, ຖານະບົດບາດຂອງຄູ່ຕໍ່ສັງຄົມ, ຄຸນປະໂຫຍດ ແລະ ຄຸນງາມຄວາມດີຂອງຄູທີ່ມີຕໍ່ປະເທດຊາດ.',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '1'
    // },

    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ເມື່ອກ່າວເຖິງປະຫວັດຄວາມເປັນມາຂອງວັນຄູແຫ່ງຊາດ ໃນສະໄຫມກ່ອນຄົນລາວທີ່ໄດ້ເຂົ້າຮຽນແມ່ນ   ມີໜ້ອຍເຕັມທີ່ ໃນຈຳນວນດັ່ງກ່າວ ໄດ້ມີຄົນລາວຊື່ ທ້າວຄຳ ໄດ້ຮຽນຈົບຫ້ອງທີ I (ປ.6). -ປີ ຄ.ສ 1907 ທ້າວຄຳໄດ້ເຂົ້າຮ່ວມຮັບການອົບຮົມຄູເຊີ່ງຖືວ່າ ເປັນຄັ້ງທຳອິດໃນປະຫວັດສາດຂອງຊາດລາວ ທີ່ໄດ້ມີການຈັດອົບຮົມຄູ, ພາຍຫຼັງການອົບຮົມສຳເລັດ ມາເຖີງວັນທີ 7 ຕຸລາ 1907 ທ້າວຄຳ ເລີ່ມເປັນຄູສອນ ຍ້ອນພວກລ່າເມືອງຂື້ນຝຣັ່ງເຫັນອິດທິພົນຂອງພະສົງໃນວຽກງານການສຶກສາ ພວກເຂົາຈຶ່ງຫັູະນນະໂຍບາຍເພື່ອຜັນຂະຫຍາຍໂຮງຮຽນໃຫ້ກວ້າງອອກກວ່າເກົ່າ ດ້ວຍຮູບການເປິດໃຫ້ມີໂຮງຮຽນສ້າງຄູສົງຂື້ນໃນປີ 1907 ທີ່ວັດຈັນ, ເຊີ່ງປະກອບມີພະສົງ 50 ກວ່າອົງໄດ້ເຂົ້າຮຽນ.',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '1'
    // },

    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ທ້າວ ຄໍາ ກໍເປັນຄູສອນຢູ່ໂຮງຮຽນສ້າງຄູສົງແຫ່ງນັ້ນ ຍ້ອນຈິດໃຈຮັກຊາດຂອງນາຍຄູຄຳ, ໃນເວລາສິດສອນຢູ່ໂຮງຮຽນສ້າງຄູສົງ ນາຍຄູຄຳ ໄດ້ເອົາໃຈໃສ່ສຶກສາອົບຮົມໃຫ້ພະສົງທີ່ຈະເປັນຄູໃຫ້ມີຄວາມຮັກຊາດລາວ, ເພື່ອບໍ່ໃຫ້ຊາດລາວເສື່ອມເສຍເປັນຊາດໃຫ້ຝຣັ່ງ ຍ້ອນພະສົງໄດ້ຮັບການສຶກສາອົບຮົມຢູ່ໃນໂຮງຮຽນຄືເຊັ່ນນັ້ນ ພາຍຫຼັງທີ່ພວກເພີ່ນຈົບການອົບຮົມຄູແລ້ວ, ກໍ່ໄດ້ມີພະສົງຫຼາຍອົງບໍ່ຍອມໄປເປັນຄູ ເພື່ອຮັບໃຊ້ນະໂຍບາຍການສຶກສາຂອງພວກລ່າເມືອງຂື້ນຝຣັ່ງ.',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '1'
    // },

    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ຕໍ່ມາປີ ຄ.ສ 1913 ຄູຄໍາ ໄດ້ສອນຢູ່ໂຮງຮຽນ ຕັບໂຟແຣງ (ປີແອ ຕັບໂຟແຣງ) ລວມມີຄູລາວ 3 ຄົນ ມາເຖີງກາງເດືອນພະຈິກ ປີ ຄ.ສ 1920 ຂະບວນການຕໍ່ສູ້ຂອງປະຊາຊົນລາວ ນຳໂດຍນາຍຄູຄຳໄດ້ລະເບິດຂື້ນຢູ່ວຽງຈັນ, ການຕໍ່ສູ້ໄດ້ດຳເນີນໄປຢ່າງຮູນແຮງ ຄູຄຳໄດ້ຖຶກພວກຝຣັ່ງຈັບ ແລະ ນຳຕົວໄປຂັງຄຸກ ພາຍຫຼັງຖຶກຄຸມຂັງໄດ້ໄລຍະໜື່ງ ນາຍຄູຄຳໄດ້ໂຕນອອກຈາກຄຸກ ແລ້ວຂ້າມແມ່ນຳ້ຂອງໄປອາໄສຢູ່ນຳພີ່ນ້ອງທີ່ບາງກອກ(ປະເທດໄທ) ຕໍ່ມາປີ 1949 ນາຍຄູຄຳໄດ້ເຈັບປ່ວຍ ແລະ ໄດ້ເສຍຊີວິດຍ້ອນພະຍາດຂອງເພີ່ນຢູ່ທີ່ ວັດສີທາຣາມ(ປະເທດໄທ).',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '1'
    // },

    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ພາຍຫຼັງປະຊາຊົນລາວໄດ້ລຸກຮື້ຂື້ນຍຶດອຳນາດ ໃນວັນທີ 12 ຕຸລາ 1945 ເປັນຕົ້ນມາ ການສຶກສາມີລັກສະນະຊາດ ຈື່ງຄອ່ຍໆປະກົດຕົວເປັນຮູບເປັນຮ່າງຂື້ນມາ ການຕໍ່ສູ້ຂອງປະຊາຊົນລາວບັນດາເຜົ່າ ເພື່ອຕ້ານກັບລັດທິລ່າເມືອງຂື້ນແບບໃໝ່ຂອງຈັກກະພັດພາຍນອກ ແລະ ຜູ້ຮຸກຮານ ໄດ້ຮັບໄຊຊະນະ ແລະ ສາທາລະນະລັດ ປະຊາທິປະໄຕ ປະຊາຊົນລາວ ໄດ້ຮັບການສະຖາປານາຂື້ນໃນວັນທີ 2 ທັນວາ 1975',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '1'
    // },
    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ພາຍຫຼັງປະຊາຊົນລາວໄດ້ລຸກຮື້ຂື້ນຍຶດອຳນາດ ໃນວັນທີ 12 ຕຸລາ 1945 ເປັນຕົ້ນມາ ການສຶກສາມີລັກສະນະຊາດ ຈື່ງຄອ່ຍໆປະກົດຕົວເປັນຮູບເປັນຮ່າງຂື້ນມາ ການຕໍ່ສູ້ຂອງປະຊາຊົນລາວບັນດາເຜົ່າ ເພື່ອຕ້ານກັບລັດທິລ່າເມືອງຂື້ນແບບໃໝ່ຂອງຈັກກະພັດພາຍນອກ ແລະ ຜູ້ຮຸກຮານ ໄດ້ຮັບໄຊຊະນະ ແລະ ສາທາລະນະລັດ ປະຊາທິປະໄຕ ປະຊາຊົນລາວ ໄດ້ຮັບການສະຖາປານາຂື້ນໃນວັນທີ 2 ທັນວາ 1975',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '2'
    // },
    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ພາຍຫຼັງປະຊາຊົນລາວໄດ້ລຸກຮື້ຂື້ນຍຶດອຳນາດ ໃນວັນທີ 12 ຕຸລາ 1945 ເປັນຕົ້ນມາ ການສຶກສາມີລັກສະນະຊາດ ຈື່ງຄອ່ຍໆປະກົດຕົວເປັນຮູບເປັນຮ່າງຂື້ນມາ ການຕໍ່ສູ້ຂອງປະຊາຊົນລາວບັນດາເຜົ່າ ເພື່ອຕ້ານກັບລັດທິລ່າເມືອງຂື້ນແບບໃໝ່ຂອງຈັກກະພັດພາຍນອກ ແລະ ຜູ້ຮຸກຮານ ໄດ້ຮັບໄຊຊະນະ ແລະ ສາທາລະນະລັດ ປະຊາທິປະໄຕ ປະຊາຊົນລາວ ໄດ້ຮັບການສະຖາປານາຂື້ນໃນວັນທີ 2 ທັນວາ 1975',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '3'
    // },
    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ພາຍຫຼັງປະຊາຊົນລາວໄດ້ລຸກຮື້ຂື້ນຍຶດອຳນາດ ໃນວັນທີ 12 ຕຸລາ 1945 ເປັນຕົ້ນມາ ການສຶກສາມີລັກສະນະຊາດ ຈື່ງຄອ່ຍໆປະກົດຕົວເປັນຮູບເປັນຮ່າງຂື້ນມາ ການຕໍ່ສູ້ຂອງປະຊາຊົນລາວບັນດາເຜົ່າ ເພື່ອຕ້ານກັບລັດທິລ່າເມືອງຂື້ນແບບໃໝ່ຂອງຈັກກະພັດພາຍນອກ ແລະ ຜູ້ຮຸກຮານ ໄດ້ຮັບໄຊຊະນະ ແລະ ສາທາລະນະລັດ ປະຊາທິປະໄຕ ປະຊາຊົນລາວ ໄດ້ຮັບການສະຖາປານາຂື້ນໃນວັນທີ 2 ທັນວາ 1975',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '3'
    // },
    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ພາຍຫຼັງປະຊາຊົນລາວໄດ້ລຸກຮື້ຂື້ນຍຶດອຳນາດ ໃນວັນທີ 12 ຕຸລາ 1945 ເປັນຕົ້ນມາ ການສຶກສາມີລັກສະນະຊາດ ຈື່ງຄອ່ຍໆປະກົດຕົວເປັນຮູບເປັນຮ່າງຂື້ນມາ ການຕໍ່ສູ້ຂອງປະຊາຊົນລາວບັນດາເຜົ່າ ເພື່ອຕ້ານກັບລັດທິລ່າເມືອງຂື້ນແບບໃໝ່ຂອງຈັກກະພັດພາຍນອກ ແລະ ຜູ້ຮຸກຮານ ໄດ້ຮັບໄຊຊະນະ ແລະ ສາທາລະນະລັດ ປະຊາທິປະໄຕ ປະຊາຊົນລາວ ໄດ້ຮັບການສະຖາປານາຂື້ນໃນວັນທີ 2 ທັນວາ 1975',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '4'
    // },
    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ພາຍຫຼັງປະຊາຊົນລາວໄດ້ລຸກຮື້ຂື້ນຍຶດອຳນາດ ໃນວັນທີ 12 ຕຸລາ 1945 ເປັນຕົ້ນມາ ການສຶກສາມີລັກສະນະຊາດ ຈື່ງຄອ່ຍໆປະກົດຕົວເປັນຮູບເປັນຮ່າງຂື້ນມາ ການຕໍ່ສູ້ຂອງປະຊາຊົນລາວບັນດາເຜົ່າ ເພື່ອຕ້ານກັບລັດທິລ່າເມືອງຂື້ນແບບໃໝ່ຂອງຈັກກະພັດພາຍນອກ ແລະ ຜູ້ຮຸກຮານ ໄດ້ຮັບໄຊຊະນະ ແລະ ສາທາລະນະລັດ ປະຊາທິປະໄຕ ປະຊາຊົນລາວ ໄດ້ຮັບການສະຖາປານາຂື້ນໃນວັນທີ 2 ທັນວາ 1975',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '4'
    // },
    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ພາຍຫຼັງປະຊາຊົນລາວໄດ້ລຸກຮື້ຂື້ນຍຶດອຳນາດ ໃນວັນທີ 12 ຕຸລາ 1945 ເປັນຕົ້ນມາ ການສຶກສາມີລັກສະນະຊາດ ຈື່ງຄອ່ຍໆປະກົດຕົວເປັນຮູບເປັນຮ່າງຂື້ນມາ ການຕໍ່ສູ້ຂອງປະຊາຊົນລາວບັນດາເຜົ່າ ເພື່ອຕ້ານກັບລັດທິລ່າເມືອງຂື້ນແບບໃໝ່ຂອງຈັກກະພັດພາຍນອກ ແລະ ຜູ້ຮຸກຮານ ໄດ້ຮັບໄຊຊະນະ ແລະ ສາທາລະນະລັດ ປະຊາທິປະໄຕ ປະຊາຊົນລາວ ໄດ້ຮັບການສະຖາປານາຂື້ນໃນວັນທີ 2 ທັນວາ 1975',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '5'
    // },
    // {
    //   stId: '1',
    //   sttitle: 'test1',
    //   stDsc: 'ພາຍຫຼັງປະຊາຊົນລາວໄດ້ລຸກຮື້ຂື້ນຍຶດອຳນາດ ໃນວັນທີ 12 ຕຸລາ 1945 ເປັນຕົ້ນມາ ການສຶກສາມີລັກສະນະຊາດ ຈື່ງຄອ່ຍໆປະກົດຕົວເປັນຮູບເປັນຮ່າງຂື້ນມາ ການຕໍ່ສູ້ຂອງປະຊາຊົນລາວບັນດາເຜົ່າ ເພື່ອຕ້ານກັບລັດທິລ່າເມືອງຂື້ນແບບໃໝ່ຂອງຈັກກະພັດພາຍນອກ ແລະ ຜູ້ຮຸກຮານ ໄດ້ຮັບໄຊຊະນະ ແລະ ສາທາລະນະລັດ ປະຊາທິປະໄຕ ປະຊາຊົນລາວ ໄດ້ຮັບການສະຖາປານາຂື້ນໃນວັນທີ 2 ທັນວາ 1975',
    //   stLaoLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   stEnLink: '../../../assets/doc/Final-IP-Law-28-03-2018-Copy-ປັບມາດຕາ-121122-Copy.pdf',
    //   createDate: '10-10-2021',
    //   refId: '5'
    // },
  ];
  url = ''
  constructor(
    private route: ActivatedRoute,
    private routes: Router,
    private api: ApiService,
    private service: ServiceService
  ) { 
    this.url =  this.service.baseURL;
  }

  ngOnInit(): void {
    this.id = Number(this.route.snapshot.paramMap.get('id'));
    this.routes.events.subscribe((event) => {
      if (event instanceof NavigationEnd) {
        this.id = Number(this.route.snapshot.paramMap.get('id'));
      }

    });

    this.loadStatisrics();
  }

  loadStatisrics():void{
    this.api.loadStatistics('').subscribe(res => {
      if(res.status === "1"){
        this.jsonData = res.data;
      }
    })
  }

  getData(): any[] {
    return this.jsonData.filter(f => f.refId === this.id.toString());
  }

  getName(): string{

    if(this.id === 1){
      return 'ສະຖິຕິພະນັກງານລັດຖະກອນ';
    }
    if(this.id === 2){
      return 'ສະຖິຕິອຸດສາຫະກໍາ ແລະ ຫັດຖະກໍາ';
    }

    if(this.id === 3 ){
      return 'ສະຖິຕິການຄ້າພາຍໃນ';
    }

    if(this.id === 4 ){
      return 'ສະຖິຕິທະບຽນວິສາຫະກິດ';
    }

    if(this.id === 5){
      return 'ສະຖິຕິນໍາເຂົ້າ ແລະ ສົ່ງອອກ'
    }

    if(this.id === 6){
      return 'ສະຖິຕິວິສາຫະກິດຂະໜາດນ້ອຍ ແລະ ກາງ'
    }
    return '';

  }

  getImgUrl(url: string):string{     
    let str = JSON.parse(url)[0];
    return this.url + str.slice(8, str.length);
  }

}
