import { Component, OnInit } from '@angular/core';
import { ApiService } from './api/api.service';

@Component({
  selector: 'app-map',
  templateUrl: './map.component.html',
  styleUrls: ['./map.component.scss']
})
export class MapComponent implements OnInit {
  show = false;
  prid = '0';
  jsonData: any[] = [
    // {
    //   prId: '1',
    //   prDsc: 'ກະຊວງສຶກສາທິການ ແລະ ກິລາ ໄດ້ເປີດນຳໃຊ້ແພລັດຟອມການຮຽນການສອນແບບດິຈີຕອນ “ຄັງປັນຍາລາວ” ຢ່າງເປັນທາງການ ຊຶ່ງເປັນແພລັດຟອມ ການຮຽນການສອນແບບດິຈີຕອນທຳອິດຂອງ ສປປ ລາວ ທີ່ມີຫຼາຍກວ່າ 23 ປະເພດຂອງແບບຮຽນ ແລະ ຫຼາຍກວ່າ 4.400 ບົດຮຽນທີ່ແຕກຕ່າງກັນ.',
    //   prTitle: 'ຫ້ອງການອຸດສາຫະກຳ ແລະ ການຄ້າ ເມືອງ ຜົ້ງສາລີ',
    //   refId: '1',
    // },
    // {
    //   prId: '2',
    //   prDsc: 'ພິທີເປີດນຳໃຊ້ແພລັດຟອມທີ່ເປັນຖານການຮຽນການສອນແບບດິຈີຕອນ “ຄັງປັນຍາລາວ” ດັ່ງກ່າວ ໄດ້ມີຂຶ້ນ ໃນວັນທີ 5 ຕຸລາ 2021 ທີ່ນະຄອນຫຼວງວຽງຈັນ ໂດຍພາຍໃຕ້ການເປັນປະທານຂອງທ່ານ ຮສ.ປອ ພຸດ ສິມມາລາວົງ ລັດຖະມົນຕີກະຊວງສຶກສາທິການ ແລະ ກິລາ ໂດຍມີພາກສ່ວນຕ່າງໆເຂົ້າຮ່ວມ ທັງແບບອັອບລາຍ ແລະ ອອນລາຍ.',
    //   prTitle: 'ຫ້ອງການອຸດສາຫະກຳ ແລະ ການຄ້າ ເມືອງ ຍອດອູ',
    //   refId: '1',
    // },
    // {
    //   prId: '3',
    //   prDsc: 'ວັນຄູແຫ່ງຊາດແມ່ນ ເປັນວັນທີ່ພົນລະເມືອງລາວທຸກເຜົ່າ ທຸກຊັ້ນຄົນໃນວົງສາຄະນາຍາດແຫ່ງຊາດລາວ ໄດ້ສະເຫລີມສະຫລອງ  ແລະ ໄດ້ທົບທວນຂະບວນວິວັດທະນາການແຫ່ງຊີວິດ ໂດຍເລີ່ມຈາກຊີວິດໃນຍາມເປັນເດັກຢູ່ໃນການລ້ຽງດູຂອງພໍ່ແມ່, ຊີວິດຂອງຕົນໃນການເຄື່ອນໄຫວສຶກສາຮໍ່າຮຽນຈົນເຖິງປັດຈຸບັນ ວ່າໄດ້ຮັບການຖ່າຍທອດຄວາມຮູ້ຫຍັງແດ່ຈາກພໍ່ແມ່ ແລະ ຄູອາຈານ ທັງນີ້ກໍ່ເພື່ອໃຫ້ທຸກຄົນໄດ້ສະແດງຄວາມກະຕັນຍູຮູ້ບຸນຄຸນຕໍ່ຄູອາຈານ ການຈັດຕັ້ງສະເຫລີມສະຫລອງວັນຄູ ຍັງແມ່ນການເຊີດຊູກຽດສັກສີ, ຖານະບົດບາດຂອງຄູ່ຕໍ່ສັງຄົມ, ຄຸນປະໂຫຍດ ແລະ ຄຸນງາມຄວາມດີຂອງຄູທີ່ມີຕໍ່ປະເທດຊາດ.',
    //   prTitle: ' ຫ້ອງການອຸດສາຫະກຳ ແລະ ການຄ້າ ເມືອງ ບຸນໃຕ້',
    //   refId: '1',
    // },
    // {
    //   prId: '4',
    //   prDsc: 'ວັນຄູແຫ່ງຊາດເປັນອີກວັນຫນຶ່ງທີ່ສໍາຄັນໃນປະຫວັດສາດຂອງຊາດລາວເຮົາ  ເພາະວ່າຄູບໍ່ໄດ້ພຽງແຕ່ປະກອບສ່ວນ ເຂົ້າໃນວຽກງານສຶກສາທໍ່ນັ້ນ ແຕ່ຍັງໄດ້ປະກອບສ່ວນຢ່າງຕັ້ງຫນ້າທີ່ສຸດ ເຂົ້າໃນພາລະກິດແຫ່ງການຕໍ່ສູ້ເພື່ອຄວາມເປັນເອກະລາດ ແລະ ຄວາມວັດທະນາຖາວອນຂອງປະເທດຊາດ ແລະ ສໍາຄັນທີ່ສຸດ ວັນຄູແຫ່ງຊາດແມ່ນວັນເອກອ້າງທະນົງໃຈຕໍ່ກຽດສັກສີ, ຕໍ່ອາຊີບຄູ ແລະ ເປັນວັນແຫ່ງການເສີມຂະຫຍາຍມູນເຊື້ອຂອງນາຍຄູຄໍາ ແລະ ນາຍຄູລາວທັງຊາດ  ຜູ້ທີ່ມີຄວາມດຸຫມັ່ນຂະຫຍັນພຽນ ແລະ ໄດ້ອຸທິດຫມົດສະຕິປັນຍາ, ເລືອດເນື້ອ ແລະ ເຫື່ອແຮງຂອງຕົນ ເພື່ອພາລະກິດການສຶກສາແຫ່ງຊາດລາວຂອງພວກເຮົາ.',
    //   prTitle: 'ຫ້ອງການອຸດສາຫະກຳ ແລະ ການຄ້າ ເມືອງ ຂວາ',
    //   refId: '1',
    // },
    // {
    //   prId: '5',
    //   prDsc: 'ເມື່ອກ່າວເຖິງປະຫວັດຄວາມເປັນມາຂອງວັນຄູແຫ່ງຊາດ ໃນສະໄຫມກ່ອນຄົນລາວທີ່ໄດ້ເຂົ້າຮຽນແມ່ນ   ມີໜ້ອຍເຕັມທີ່ ໃນຈຳນວນດັ່ງກ່າວ ໄດ້ມີຄົນລາວຊື່ ທ້າວຄຳ ໄດ້ຮຽນຈົບຫ້ອງທີ I (ປ.6). -ປີ ຄ.ສ 1907 ທ້າວຄຳໄດ້ເຂົ້າຮ່ວມຮັບການອົບຮົມຄູເຊີ່ງຖືວ່າ ເປັນຄັ້ງທຳອິດໃນປະຫວັດສາດຂອງຊາດລາວ ທີ່ໄດ້ມີການຈັດອົບຮົມຄູ, ພາຍຫຼັງການອົບຮົມສຳເລັດ ມາເຖີງວັນທີ 7 ຕຸລາ 1907 ທ້າວຄຳ ເລີ່ມເປັນຄູສອນ ຍ້ອນພວກລ່າເມືອງຂື້ນຝຣັ່ງເຫັນອິດທິພົນຂອງພະສົງໃນວຽກງານການສຶກສາ ພວກເຂົາຈຶ່ງຫັູະນນະໂຍບາຍເພື່ອຜັນຂະຫຍາຍໂຮງຮຽນໃຫ້ກວ້າງອອກກວ່າເກົ່າ ດ້ວຍຮູບການເປິດໃຫ້ມີໂຮງຮຽນສ້າງຄູສົງຂື້ນໃນປີ 1907 ທີ່ວັດຈັນ, ເຊີ່ງປະກອບມີພະສົງ 50 ກວ່າອົງໄດ້ເຂົ້າຮຽນ.',
    //   prTitle: 'ຫ້ອງການອຸດສາຫະກຳ ແລະ ການຄ້າ ເມືອງ ໃໝ່',
    //   refId: '1',
    // },
    // {
    //   prId: '6',
    //   prDsc: 'ທ້າວ ຄໍາ ກໍເປັນຄູສອນຢູ່ໂຮງຮຽນສ້າງຄູສົງແຫ່ງນັ້ນ ຍ້ອນຈິດໃຈຮັກຊາດຂອງນາຍຄູຄຳ, ໃນເວລາສິດສອນຢູ່ໂຮງຮຽນສ້າງຄູສົງ ນາຍຄູຄຳ ໄດ້ເອົາໃຈໃສ່ສຶກສາອົບຮົມໃຫ້ພະສົງທີ່ຈະເປັນຄູໃຫ້ມີຄວາມຮັກຊາດລາວ, ເພື່ອບໍ່ໃຫ້ຊາດລາວເສື່ອມເສຍເປັນຊາດໃຫ້ຝຣັ່ງ ຍ້ອນພະສົງໄດ້ຮັບການສຶກສາອົບຮົມຢູ່ໃນໂຮງຮຽນຄືເຊັ່ນນັ້ນ ພາຍຫຼັງທີ່ພວກເພີ່ນຈົບການອົບຮົມຄູແລ້ວ, ກໍ່ໄດ້ມີພະສົງຫຼາຍອົງບໍ່ຍອມໄປເປັນຄູ ເພື່ອຮັບໃຊ້ນະໂຍບາຍການສຶກສາຂອງພວກລ່າເມືອງຂື້ນຝຣັ່ງ.',
    //   prTitle: 'ຫ້ອງການອຸດສາຫະກຳ ແລະ ການຄ້າ ເມືອງ ສຳພັນ',
    //   refId: '1',
    // },
  ];
  constructor(private api: ApiService) { }

  ngOnInit(): void {
    this.loadData();
  }

  loadData():void{
    const modal ={}
    this.api.loadProcess(modal).subscribe(res => {
      this.jsonData = res.data;
    })
  }

  getData(): any[]{
    return  this.jsonData.filter(f => f.refId === "2").reverse();
  }

}
